C Содержит подпрограмму FORCE
C     ПOДПPOГPAMMA PAЗHECEHИЯ HAГPУЗOK ПО УЗЛАМ
C     BЫЗЫBAETCЯ ИЗ MAIN, вызываемых модулей нет.
C ==================================================================
*     IPR массив управления печатью
*FORCEX - массив состоящий из номеров точек и координат X точек к которым приложена 
*распределенная сила
*CORD - одномерный массив глобальных координат узлов (первые два элемента этого массива 
*являются координатами узла 1 по оси Х и Y соответственно, вторая пара элементов - узла 2 и т.д.).
*R - массив значений усилий в узлах (аналогичен по структуре массиву CORD, только вместо координат
* в нем указываются значения нагрузок по оси Х и Y в узлах); 
C ==================================================================
C wwwwwwwwwwwwwwwwww начало кода FORCE wwwwwwwwwwwwwwwwwwwwwwwwwwwww
C ==================================================================
      SUBROUTINE FORCE(NB,CORD,NRC,DB,IPR,NP,RSUM,R,NDF,DH,NR,
     >PRM1,PRM2,PRM3,PRM4,PRM5,PRM6)

      LOGICAL*1 IPR(50)
      DIMENSION CORD(1),R(1),FORCEX(100),FORCEY(100)
      REAL Y1,Y2,Y3,XT,YT,X1,X2,X3,R1,S
      INTEGER I,J,TMPI,I1,FORCEX
       IF(IPR(22)) WRITE(6,22)PRM1,PRM2,PRM3,PRM4,PRM5,PRM6
      IF(IPR(23)) WRITE(6,20)
      NR=0
      I1=0
*I1-кол-во точек к которым приложена расспределенная сила
*NR - количество нагруженных узлов. 
* NP - количество узлов      
      DO 10 I=1,NP
* Обрабатываемые точки
        XT=CORD(NDF*(I-1)+1)
        YT=CORD(NDF*(I-1)+2)
C Обнуление массива сил
        R(NDF*(I-1)+1)=0
        R(NDF*(I-1)+2)=0
        IF ((ABS((-1*XT+70)-YT).LT.0.01).AND.(XT.GE.20)) THEN
* все точки к которым приложена распределленная сила записываются в массив FORCEX
* номер точки
            I1=I1+1
            FORCEX(I1)=I
* координата по X
            NR=NR+1
        ENDIF
* Сила приложенная к окружности
        IF ((XT.LT.0.01).AND.(ABS(YT-DH).LT.0.01)) THEN
*DH - высота объекта;
                NR=NR+1
                R(NDF*(I-1)+2)=PRM5/2.
      IF(IPR(23)) WRITE(6,21) NR,I,CORD(NDF*(I-1)+1),
     > CORD(NDF*(I-1)+2),R((I-1)*NDF+1),R((I-1)*NDF+2)
        ENDIF
* Сила направленная к центру пластины
        IF ((YT.LT.0.01).AND.(ABS(XT-DB).LT.0.01)) THEN
*DB - ширина объекта;
                NR=NR+1
                R(NDF*(I-1)+1)=-1*PRM5/2.
      IF(IPR(23)) WRITE(6,21) NR,I,CORD(NDF*(I-1)+1),
     > CORD(NDF*(I-1)+2),R((I-1)*NDF+1),R((I-1)*NDF+2)
      
        ENDIF
10    CONTINUE
* Занесение значения распределенной силы
*---------------------------------------------------------------------            
      DO 200 I=I1,2,-1
        DO 200 J=1,I-1
            IF (CORD(NDF*(FORCEX(J+1)-1)+1).LT.CORD(NDF*(FORCEX(J)
     >-1)+1)) THEN
                TMPI=FORCEX(J+1)
                FORCEX(J+1)=FORCEX(J)
                FORCEX(J)=TMPI
200            ENDIF

* Задание распределенной силы
      DO 300 I=1,I1
        J=FORCEX(I)
* Координата текущей точки
        X1=CORD(2*(FORCEX(I)-1)+1)
        Y1=CORD(2*(FORCEX(I)-1)+2)
* Координата преведущей точки    
        IF (I.NE.1) THEN 
            X3=CORD(2*(FORCEX(I-1)-1)+1)
            Y3=CORD(2*(FORCEX(I-1)-1)+2)
            ELSE
            X3=X1
            Y3=Y1
        ENDIF
* Координата следующей точки
        IF (I.NE.I1) THEN
            X2=CORD(2*(FORCEX(I+1)-1)+1)
            Y2=CORD(2*(FORCEX(I+1)-1)+2)
            ELSE
            X2=X1
            Y2=Y1
        ENDIF
* Сила приложенная к текущему узлу (вычесляется через площадь трапеции)
* S-размер участка поверхности между силами
* R1-распределенная сила приложенная к текущему узлу
        S=(((X2-X1)/2.+(X1-X3)/2.)**2+((Y2-Y1)/2.+(Y1-Y3)/2.)**2)**0.5
        R1=S*((-PRM4*((X1+X2)/2.-50))/30.+
     >(-PRM4*((X1+X3)/2.-50))/30.)/2.
        R(NDF*(FORCEX(I)-1)+1)=R1*SIN(45.0*3.1416/180.)
        R(NDF*(FORCEX(I)-1)+2)=R1*SIN(45.0*3.1416/180.)
      IF(IPR(23)) WRITE(6,21) NR,J,CORD(NDF*(J-1)+1),
     > CORD(NDF*(J-1)+2),R((J-1)*NDF+1),R((J-1)*NDF+2)        
300         continue
*-----------------------------------------------------------------------
       IF(IPR(23)) PRINT *,"ЧИСЛО НАГРУЖЕННЫХ УЗЛОВ NR=",NR
21     FORMAT  (2I6,1X,2F10.3,4X,2F9.2)

 122  RETURN
      IF (NR.NE.0) GOTO 122
      WRITE(6,6) (I,(R((I-1)*NDF+J),J=1,NDF),I=1,NP)
   6  FORMAT (' HE HAЙДEHЫ TOЧKИ ПPИЛOЖEHИЯ HAГPУЗOK'/8(I4,2G10.2))
  20  FORMAT (' PACПPEДEЛEHИE HAГPУЗOK'/ '     N    УЗEЛ   X-COORD',
     >        '    Y-COORD       * RX *     * RY *')
  22  FORMAT ('     CУMMAPHAЯ HAГPУЗKA     '/'     * RX *  * RY *'/
     >      (3X,2F11.3))
      STOP
      END
C ==================================================================
C wwwwwwwwwwwwwwwwww конец кода FORCE wwwwwwwwwwwwwwwwwwwwwwwwwwwww
C ==================================================================